---
type: SweptProfile
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# SweptProfile

`Autodesk.Revit.DB.SweptProfile` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDrivingCurve | 2016 | `public Curve GetDrivingCurve ()` |
| Method | GetSweptProfile | 2016 | `public Profile GetSweptProfile ()` |
| Property | EndSetBack | 2016 | `public double EndSetBack { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartSetBack | 2016 | `public double StartSetBack { get ; }` |